БухЭксп/Enums/CW_ВидыОперативнойЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыОперативнойЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_ЗакрытиеГрузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ЗакрытиеГрузоперевозки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_ПеревыставлениеПоСтавкам</xr:Item>
				<xr:Item>AccumulationRegister.CW_ВознаграждениеПоГрузоперевозкам</xr:Item>
				<xr:Item>AccumulationRegister.CW_ДоходыПоГрузоперевозкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытиеПоЗаказу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодробноеПредставлениеНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируетсяАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируетсяСчетФактура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомыйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСпособаВыставления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вознаграждение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыПоГрузоперевозке</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходыПоГрузоперевозке</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/CommonModules/CW_ОбщиеПараметры/Ext/Module.bsl
Процедура СформироватьОбщиеПараметры(Объект,Разделы=Неопределено,ИнтерактивныйРежим=Истина) Экспорт 
	
	Метаданное = Объект.Метаданные().ПолноеИмя();
	ШаблонСписков = CW_ОбщиеПараметры_ПИ.ШаблонОбщихПараметров(Метаданное,ИнтерактивныйРежим);
	
	СтруктураПараметров=_сф.ст_Создать("ПараметрыДоговора,Константы,УчетнаяПолитика,НастройкиПользователя");
	НачальноеЗначение = ?(Разделы=Неопределено,Истина,Ложь);
	СтруктураПараметров.ПараметрыДоговора		=	НачальноеЗначение;
	СтруктураПараметров.Константы				=	НачальноеЗначение;
	СтруктураПараметров.УчетнаяПолитика			=   НачальноеЗначение;
	СтруктураПараметров.НастройкиПользователя	=   НачальноеЗначение;
	
	// анализируем переданный список
	Если Разделы <> Неопределено Тогда
		
		СписокРазделов = _сф.м_СоздатьИзСтроки(Разделы,",");
		Для каждого Стр Из СписокРазделов Цикл
			
			СтруктураПараметров[Стр]=Истина;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Если Метаданное = "Документ.CW_ДоходыПоГрузоперевозке" Тогда
		
		ДатаАктуальности = ?(Объект.ДатаАкта=Дата(1,1,1),Объект.Дата,Объект.ДатаАкта);
		ПроверятьБУ = Истина;
		ПроверятьОЗ = Истина;
		ВидОЗ = Перечисления.CW_ВидыОперативнойЗадолженности.Дебиторская;
		
	ИначеЕсли Метаданное = "Документ.CW_РасходыПоГрузоперевозке" 
		ИЛИ Метаданное = "Документ.CW_РасходыПоПриобретениям" Тогда 
		
		Если Объект.ФормироватьВедомыеДатойДокумента тогда
			ДатаАктуальности = Объект.Дата;
		Иначе
			ДатаАктуальности = ?(Объект.ДатаАкта=Дата(1,1,1),Объект.Дата,Объект.ДатаАкта);
		КонецЕсли;
	
		ПроверятьБУ = Истина;
		ПроверятьОЗ = Истина;
		ВидОЗ = Перечисления.CW_ВидыОперативнойЗадолженности.Кредиторская;
		
	ИначеЕсли Метаданное = "Документ.CW_ЗакрытиеГрузоперевозки" Тогда 
		
		ДатаАктуальности = Объект.Дата;
		ПроверятьБУ = Ложь;
		ПроверятьОЗ = Ложь;
		
	ИначеЕсли Метаданное = "Документ.CW_РасходыПодотчетногоЛица" Тогда 
		
		ДатаАктуальности = Объект.Дата;
		ПроверятьБУ = Ложь;
		ПроверятьОЗ = Ложь;
		
	КонецЕсли; 
	
	// параметры договора
	Если СтруктураПараметров.ПараметрыДоговора Тогда
		
		СтруктураПараметровДоговора = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
		СтруктураПараметровДоговора.Дата 				= ДатаАктуальности;
		СтруктураПараметровДоговора.Договор 			= Объект.Договор;
		СтруктураПараметровДоговора.ПриложениеКДоговору = Объект.ПриложениеКДоговору;
		
		ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметровДоговора);
		
		_сф.ст_УстановитьСвойство(Объект.ДополнительныеСвойства,"ПД",ПараметрыДоговора);	
	КонецЕсли; 
	
	// константы
	Если СтруктураПараметров.Константы Тогда
		СтруктураКонстант = Новый Структура;
		Для каждого Константа Из ШаблонСписков.СписокКонстант Цикл
			_сф.ст_УстановитьСвойство(СтруктураКонстант,Константа,Константы[Константа].Получить());			
		КонецЦикла; 
		_сф.ст_УстановитьСвойство(Объект.ДополнительныеСвойства,"КО",СтруктураКонстант);
	КонецЕсли; 
	
	// учетная политика
	Если СтруктураПараметров.УчетнаяПолитика Тогда
		
		СтруктураПараметровБухУчета = Новый Структура;
		СтруктураПараметровБухУчета.Вставить("Договор", 				Объект.Договор);
		СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		Объект.ПриложениеКДоговору);
		
		ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Объект.Дата);
		
		СтруктураПараметровУчетнойПолитики = Новый Структура;
		Если ШаблонСписков.СписокУП.Количество() <> 0 Тогда
			УП = CW_Настройки.ПараметрыУчетнойПолитики(ДатаАктуальности,Объект.Организация);
			Для каждого ПараметрУП Из ШаблонСписков.СписокУП Цикл
				_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,ПараметрУП,УП[ПараметрУП]);
			КонецЦикла;  
		КонецЕсли; 
	//	Если (ШаблонСписков.СписокГУП.Количество() <> 0 И ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет) Тогда
		Если ШаблонСписков.СписокГУП.Количество() <> 0 Тогда
			ГУП = CW_Настройки.ПараметрыГлобальнойУчетнойПолитики(ДатаАктуальности,Объект.Организация);
			Для каждого ПараметрГУП Из ШаблонСписков.СписокГУП Цикл
				_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,ПараметрГУП,ГУП[ПараметрГУП]);
			КонецЦикла;
		КонецЕсли; 
		
		// определяем параметры оперативной задолженности
		Если ПроверятьБУ Тогда
			
			ДатаНачалаВеденияУчетаБУ = CW_Настройки.ПолучитьДатуНачалаВеденияУчета(Объект.Организация);
			Если ДатаНачалаВеденияУчетаБУ <> Неопределено Тогда
				ВводОстатковБУ = (Объект.Дата < ДатаНачалаВеденияУчетаБУ);		
			Иначе
				ВводОстатковБУ = Ложь;
			КонецЕсли;
			
			_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,"БУ",Истина);
			_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,"ВводОстатковБУ",ВводОстатковБУ);
			_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,"ДатаНачалаВеденияУчетаБУ",ДатаНачалаВеденияУчетаБУ);
			
		КонецЕсли; 
		Если ПроверятьОЗ Тогда
			
			СтруктураНастроек = CW_Настройки.ПолучитьНастройкиОперативногоУчета(Объект.Организация, ВидОЗ, Объект.Дата); 
			НачалоВеденияУчета	= СтруктураНастроек["НачалоВеденияУчета"];
			ОперативныйУчет		= СтруктураНастроек["ВедетсяОперативныйУчет"]; 
			ВводОстатковОУ		= СтруктураНастроек["ВводОстатков"]; 
			
			НастройкиОперативногоУчета	= СтруктураНастроек["НастройкиОперативногоУчета"]; 
			РаздельныйУчетОперативнойИБухгалтерскойЗадолженности 	= НастройкиОперативногоУчета["РаздельныйУчет"];
			УчитыватьПереплатыПоДокументамКакАванс 					= НастройкиОперативногоУчета["УчитыватьПереплатыПоДокументамКакАванс"];
		
			_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,"ОЗ",							ОперативныйУчет);
			_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,"ВводОстатковОЗ",				ВводОстатковОУ);
			_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,"ДатаНачалаВеденияУчетаОЗ",	НачалоВеденияУчета);
			
			_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,"РаздельныйУчетОперативнойИБухгалтерскойЗадолженности", РаздельныйУчетОперативнойИБухгалтерскойЗадолженности);
			_сф.ст_УстановитьСвойство(СтруктураПараметровУчетнойПолитики,"УчитыватьПереплатыПоДокументамКакАванс", 				 УчитыватьПереплатыПоДокументамКакАванс);
			
			
		КонецЕсли; 
		
		_сф.ст_УстановитьСвойство(Объект.ДополнительныеСвойства,"УП",СтруктураПараметровУчетнойПолитики);
		
	КонецЕсли; 
	
	// настройки пользователя
	Если СтруктураПараметров.НастройкиПользователя Тогда
		
		СтруктураНастроекПользователя = новый Структура;
		Для каждого НастройкаПользователя Из ШаблонСписков.СписокНП Цикл
			_сф.ст_УстановитьСвойство(СтруктураНастроекПользователя,НастройкаПользователя,CW_Настройки.ПолучитьНастройкуПользователя(,НастройкаПользователя));		
		КонецЦикла; 
		_сф.ст_УстановитьСвойство(Объект.ДополнительныеСвойства,"НП",СтруктураНастроекПользователя);
		
	КонецЕсли; 
	
	_сф.ст_УстановитьСвойство(Объект.ДополнительныеСвойства,"ПерваяЗаписьОбъекта",	Не ЗначениеЗаполнено(Объект.Ссылка));
КонецПроцедуры

Функция ОбщиеПараметрыЗаполнены(Объект) Экспорт 
	// --- 
	
	ТребуетсяФормирование = Ложь;
	// --- 
	ДС = Объект.ДополнительныеСвойства;
	
	Если НЕ ДС.Свойство("ПД") Тогда
		
		ТребуетсяФормирование = Истина;
		
	КонецЕсли; 
	Если НЕ ДС.Свойство("КО") Тогда
		
		ТребуетсяФормирование = Истина;
		
	КонецЕсли; 
	Если НЕ ДС.Свойство("НП") Тогда
		
		ТребуетсяФормирование = Истина;
		
	КонецЕсли;
	Если НЕ ДС.Свойство("УП") Тогда
		
		ТребуетсяФормирование = Истина;
		
	КонецЕсли;
	
	Возврат(НЕ ТребуетсяФормирование);
	
	// --- 
КонецФункции
